responses = {
    'start' : 'Привет, {}! 👋\n\nДобро пожаловать в систему управления РУПами. '
             'Я помогу тебе загрузить и управлять информацией по твоим РУПам.',

    'get_data' : '📊Просмотреть данные по РУПам',

    'upload_data' : '⬆️Загрузить данные по РУПам',

    'sign_up' : 'Зарегистрироваться в боте',

    'pass_auth' : 'Пройдите сначала регистрацию',

    'rup_file_not_found' : 'Вы еще не загрузили документы',

    'fsm_input_last_name' : 'Введи свою фамилию',

    'fsm_input_first_name' : 'А теперь свое имя',

    'about_middle_name' : 'У тебя есть отчество?',

    'answer_yes' : 'Да',

    'answer_no' : 'Нет',

    'fsm_input_middle_name' : 'Введи свое отчество',

    'fsm_input_group_number' : 'Какой у тебя номер группы?',

    'fsm_want_input_email' : 'Хотите указать свою почту?',

    'fsm_input_email' : 'Укажи свою почту',

    'fsm_want_input_phone' : 'Хотите указать свой номер телефона?',

    'fsm_input_phone' : 'Укажи свой номер телефона',

    'is_total_info_correct' : 'Указанная информация верная?',

    'refill_info_about_user' : 'Давай попробуем еще раз',

    'success_auth' : 'Авторизация прошла успешно',

    'request_data' : 'Пожалуйста, загрузи файл с информацией по твоим РУПам. 📁\n'
                     'Поддерживаются следующие форматы: .docx, .pdf, .xls.',

    'success_upload' : 'Спасибо, файл успешно загружен и информация обновлена! ✅',

    'unsuccessful_upload' : 'Похоже, загруженный файл не содержит данных по РУПам. Попробуй еще раз.\n'
         'Поддерживаются следующие форматы: .docx, .pdf, .xls.',

    'uploaded_other_format' : 'Файл должен быть в одном из следующих форматов: .docx, .pdf, .xls.\n'
                         'Попробуй снова загрузить файл в правильном формате.',

    'help' : 'Ты в разделе помощи. Вот список команд, которые ты можешь использовать:\n\n'
            '1️⃣ /upload – Эта команда позволяет загрузить файл с твоими РУПами. Поддерживаются форматы .docx, .pdf, .xls.\n'
            '2️⃣ /get – Эта команда покажет текущий статус твоих РУПов, если они уже загружены в базу.',

    'exception' : 'К сожалению, не понял тебя. Попробуй еще раз.'
}


matching_init_user_field = {
    'surname' : 'Фамилия',
    'name' : 'Имя',
    'patronymic' : 'Отчество',
    'group' : 'Номер группы',
    'email' : 'Почта',
    'phone_number' : 'Номер телефона'
}