responses = {
    'start' : 'Привет, {}! 👋\n\nДобро пожаловать в систему управления РУПами. '
             'Я помогу тебе загрузить и управлять информацией по твоим РУПам.',

    'get_data' : '📊Просмотреть данные по РУПам',

    'upload_data' : '⬆️Загрузить данные по РУПам',

    'request_data' : 'Пожалуйста, загрузи файл с информацией по твоим РУПам. 📁\n'
                     'Поддерживаются следующие форматы: .docx, .pdf, .xls.',

    'success_upload' : 'Спасибо, файл успешно загружен и информация обновлена! ✅\n'
                       'Хочешь установить напоминание на важные даты по РУПам? 📅',

    'unsuccessful_upload' : 'Файл должен быть в одном из следующих форматов: .docx, .pdf, .xls.\n'
                         'Попробуй снова загрузить файл в правильном формате.',

    'set_reminder' : '🔔 Установить напоминание',

    'unset_reminder' : '❌ Не нужно напоминание',

    'help' : 'Ты в разделе помощи. Вот список команд, которые ты можешь использовать:\n\n'
            '1️⃣ /upload – Эта команда позволяет загрузить файл с твоими РУПами. Поддерживаются форматы .docx, .pdf, .xls.\n'
            '2️⃣ /get – Эта команда покажет текущий статус твоих РУПов, если они уже загружены в базу.\n'
            '3️⃣ Установить напоминание – Ты можешь установить напоминание на важные даты по РУПам.',

    'exception' : 'К сожалению, не понял тебя. Попробуй еще раз.'
}