responses = {
    'start' : 'Привет, {}! 👋\n\nДобро пожаловать в систему управления РУПами. '
             'Я помогу тебе загрузить и управлять информацией по твоим РУПам.',

    'get_info' : '📊Просмотреть данные по РУПам',

    'upload_info' : '⬆️Загрузить данные по РУПам',

    'help' : 'Ты в разделе помощи. Вот список команд, которые ты можешь использовать:\n\n'
            '1️⃣ /upload – Эта команда позволяет загрузить файл с твоими РУПами. Поддерживаются форматы .docx, .pdf, .xls.\n'
            '2️⃣ /get – Эта команда покажет текущий статус твоих РУПов, если они уже загружены в базу.\n'
            '3️⃣ Установить напоминание – Ты можешь установить напоминание на важные даты по РУПам.',

    'exception' : 'К сожалению, не понял тебя. Попробуй еще раз.'
}